Reports/зм_ОтчетПоСрокамПогашенияКредитовЗаймов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>зм_ОтчетПоСрокамПогашенияКредитовЗаймов</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Типовой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Типовой</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Типовой</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/СчетаУчетаПоКредитамИЗаймам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СчетаУчетаПоКредитамИЗаймам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСчетаУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКредитовИЗаймов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКредитовИЗаймов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКредитовИЗаймов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Полученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выданные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/зм_ОтчетПоСрокамПогашенияКредитовЗаймов/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "";
	УниверсальныйОтчет.ИмяРегистра = "-";
	
	
	//Содержит текст построителя отчета
	
	Текст =
	"ВЫБРАТЬ
	|   Выборка.Контрагент КАК Контрагент,
	|   Выборка.Договор КАК Договор,
	|   Выборка.ВалСумма КАК ВалСумма,
	|   Выборка.Сумма КАК Сумма
	|{ВЫБРАТЬ
	|	Выборка.Организация.*,
	|	Выборка.ИсточникФинансирования.*,
	//|	Контрагент.*,
	|	Договор.*}
	//|	Выборка.Валюта,
	//|	Выборка.ДатаПоступления
	|ИЗ	(ВЫБРАТЬ
	|		ТиповойОстатки.Организация КАК Организация,
	|		ТиповойОстатки.ИсточникФинансирования КАК ИсточникФинансирования,
	|		ДанныеОПоступлении.Период КАК ДатаПоступления,
	|		ВЫРАЗИТЬ(ТиповойОстатки.Валюта Как Справочник.Валюты) КАК Валюта,
	|		ВЫРАЗИТЬ(ТиповойОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|		ВЫРАЗИТЬ(ТиповойОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	|		Сумма(ТиповойОстатки.ВалютнаяСуммаОстатокКт) КАК ВалСумма,
	|		Сумма(ТиповойОстатки.СуммаОстатокКт)  КАК Сумма
	|	ИЗ
	|		РегистрБухгалтерии.Типовой.Остатки(&ДатаКон, 
	|			Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						СписокСчетов.СчетУчета
	|					ИЗ
	|					   РегистрСведений.СчетаУчетаПоКредитамИЗаймам КАК СписокСчетов
	|					ГДЕ
	|					   СписокСчетов.ТипСчетаУчета = &ТипСчетаУчета	
	|					),
	|			, 
	|			{(Организация).*,
	|			(ИсточникФинансирования).*}) КАК ТиповойОстатки
	|
	|   Левое соединение
	|         (ВЫБРАТЬ
	|				ВЫРАЗИТЬ(ОборотыДтКт.СубконтоКТ2 КАК Справочник.ДоговорыКонтрагентов) Как Договор,
	|				Минимум(ОборотыДтКт.Период) Как Период
	|          Из
	|			  РегистрБухгалтерии.Типовой.ОборотыДтКт(
	|				, 
	|				&ДатаКон, 
	|				Регистратор, 
	|				СчетДт в ИЕРАРХИИ (&СчетаУчетаДС),
	|				, 
	|				СчетКт В (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							СписокСчетов.СчетУчета
	|						  ИЗ
	|			   				РегистрСведений.СчетаУчетаПоКредитамИЗаймам КАК СписокСчетов
	|						  ГДЕ
	|			   				СписокСчетов.ТипСчетаУчета = &ТипСчетаУчета	
	|						 ), 
	|				,
	|				{(Организация).*,
	|					(ИсточникФинансирования).*}) КАК ОборотыДтКт
	|			СГРУППИРОВАТЬ ПО ОборотыДтКт.СубконтоКТ2
	|           ) КАК ДанныеОПоступлении
	|     ПО  ДанныеОПоступлении.Договор = ТиповойОстатки.Субконто2 
	|
	|	СГРУППИРОВАТЬ ПО
	|		ТиповойОстатки.Организация,
	|		ТиповойОстатки.ИсточникФинансирования,
	|		ТиповойОстатки.Субконто1,
	|		ТиповойОстатки.Субконто2,
	|		ТиповойОстатки.Валюта,
	|		ДанныеОПоступлении.Период
	|	) КАК Выборка
	|{ГДЕ
	|	Выборка.Контрагент.*,
	|	Выборка.Организация.*,
	|	Выборка.ИсточникФинансирования.*}
	|{УПОРЯДОЧИТЬ ПО
	|	Выборка.Организация.*,
	|	Выборка.ИсточникФинансирования.*,
	|	Контрагент.*}
	|ИТОГИ
	|	СУММА(ВалСумма),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Выборка.Организация,
	|	Выборка.ИсточникФинансирования,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	ДатаПоступления}
	|АВТОУПОРЯДОЧИВАНИЕ";

	УниверсальныйОтчет.ПостроительОтчета.Текст = Текст;
	
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	 УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	//УниверсальныйОтчет.ДобавитьПолеГруппировка("БазоваяЕдиницаИзмерения", "Номенклатура", "БазоваяЕдиницаИзмерения", "Базовая единица измерения");
	//
	
	//Заполнить представление полей
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Договор.Владелец","Заимодавец");
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	УниверсальныйОтчет.ДобавитьПоказатель("ВалСумма",   "Вал.сумма",       Истина, "ЧЦ=17; ЧДЦ=2", "Сумма", "Сальдо на дату периода");
	УниверсальныйОтчет.ДобавитьПоказатель("Сумма", 		"Сумма в тенге",   Истина, "ЧЦ=17; ЧДЦ=2", "Сумма", "Сальдо на дату периода");
	
	//отборы по умолчанию
    УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ТипСчетаучета",Перечисления.ТипыКредитовИЗаймов.Полученные);
    УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СчетаУчетаДС",ПланыСчетов.Типовой.ДенежныеСредства);
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ИсточникФинансирования");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Договор");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("ИсточникФинансирования");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Договор.Владелец",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Договор.ДатаПогашения",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно перередать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
